{
  "add_bos_token": true,
  "add_eos_token": false,
  "add_prefix_space": true,
  "added_tokens_decoder": {
    "0": {
      "content": "<unk>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "1": {
      "content": "<s>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "2": {
      "content": "</s>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "32000": {
      "content": "<pad>",
      "lstrip": false,
      "normalized": true,
      "rstrip": false,
      "single_word": false,
      "special": true
    }
  },
  "bos_token": "<s>",
  "chat_template": "{% if messages[0]['role'] == 'system' %}\n    {% set loop_messages = messages[1:] %}\n    {% set system_message = messages[0]['content'] %}\n{% else %}\n    {% set loop_messages = messages %}\n    {% set system_message = false %}\n{% endif %}\n{% for message in loop_messages %}\n    {% if loop.index0 == 0 and system_message != false %}\n        {% set content = '<<SYS>>\\n' + system_message + '\\n<</SYS>>\\n\\n' + message['content'] %}\n    {% else %}\n        {% set content = message['content'] %}\n    {% endif %}\n    {% if message['role'] == 'user' %}\n        {{- bos_token + '[INST] ' + content.strip() + ' [/INST]' -}}\n    {% elif message['role'] == 'system' %}\n        {{- '<<SYS>>\\n' + content.strip() + '\\n<</SYS>>\\n\\n' -}}\n    {% elif message['role'] == 'assistant' %}\n        {{- ' '  + content.strip() + ' ' + eos_token -}}\n    {% endif %}\n{% endfor %}\n",
  "clean_up_tokenization_spaces": false,
  "eos_token": "</s>",
  "legacy": false,
  "model_max_length": 2048,
  "pad_token": "<pad>",
  "padding_side": "right",
  "sp_model_kwargs": {},
  "spaces_between_special_tokens": false,
  "tokenizer_class": "LlamaTokenizer",
  "unk_token": "<unk>",
  "use_default_system_prompt": false
}
